app/controllers/api/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT  "songs".* FROM "songs" ORDER BY "songs"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @song = Song.new(song_params)

    @song.artist_id = current_user.id
    if @song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at", "data_file_name", "data_content_type", "data_file_size", "data_updated_at", "cover_art_file_name", "cover_art_content_type", "cover_art_file_size", "cover_art_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @song = Song.find(params[:id])

    if @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "songs" SET "cover_art_file_name" = $1, "cover_art_file_size" = $2, "cover_art_updated_at" = $3, "updated_at" = $4 WHERE "songs"."id" = $5  [["cover_art_file_name", "No_Other.jpg"], ["cover_art_file_size", 73496], ["cover_art_updated_at", 2017-04-24 17:40:45 UTC], ["updated_at", 2017-04-24 17:40:45 UTC], ["id", 7]]

  def destroy
    @song = Song.find(params[:id])

    if @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 6]]