app/controllers/api/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Song.where(artist_id: params[:artist_id]).includes(:artist).order('created_at DESC')
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1 ORDER BY created_at DESC  [["artist_id", 13]]

  def show
    @song = Song.includes(:artist).find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]