app/views/api/songs/_song.json.jbuilder

json.data asset_path(song.data.url)
json.date song.created_at
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at", "data_file_name", "data_content_type", "data_file_size", "data_updated_at", "cover_art_file_name", "cover_art_content_type", "cover_art_file_size", "cover_art_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"